my-performance-benchmark/public/summary.txt
--------------------------------
Summary report @ 15:37:26(-04:00)
--------------------------------

http.codes.200:                    ................................................. 2834
http.codes.429:                    ................................................. 405
http.responses.2xx:                ............................................. 2,834 (87.5%)
http.responses.non_2xx:            ......................................... 405 (12.5%)
http.downloaded_bytes:             .......................................... 31162633
http.request_rate:                 .............................................. 53.1/sec
http.requests:                     .................................................. 3239
http.response_time (ms):
  min:                             .......................................................... 61
  max:                             .......................................................... 358
  median:                          ....................................................... 113
  p90:                             .......................................................... 142
  p95:                             .......................................................... 155
  p99:                             .......................................................... 183
http.responses:                    ................................................. 3239
http.unexpected_responses:         ...................................... 405
vusers.completed:                  ............................................... 0
vusers.created:                    ................................................. 60
vusers.created_by_name.0:          ....................................... 60
vusers.failed:                     .................................................. 60
vusers.session_length (ms):
  min:                             .......................................................... 60017
  max:                             .......................................................... 61022
  median:                          ....................................................... 60365
  p90:                             .......................................................... 60747
  p95:                             .......................................................... 60911
  p99:                             .......................................................... 61022